## Data Manipulation and Analysis with Pandas
Data manipulation and analysis are key tasks in any data science or data analysis project. Pandas provides a wide range of functions for data manipulation and analysis, making it easier to clean, transform, and extract insights from data. In this lesson, we will cover various data manipulation and analysis techniques using Pandas.

In [2]:
import pandas as pd

In [3]:
url = "https://raw.githubusercontent.com/tajamulkhann/Python-DSA/refs/heads/main/m.%20Python%20for%20Data%20Analysis/data.csv"
df = pd.read_csv(url)

In [4]:
df.tail(5)

         Car   Model  Volume  Weight  CO2
31     Volvo    XC70    2000    1746  117
32      Ford   B-Max    1600    1235  104
33       BMW     216    1600    1390  108
34      Opel  Zafira    1600    1405  109
35  Mercedes     SLK    2500    1395  120

In [5]:
df.describe()

            Volume       Weight         CO2
count    36.000000    36.000000   36.000000
mean   1611.111111  1292.277778  102.027778
std     388.975047   242.123889    7.454571
min     900.000000   790.000000   90.000000
25%    1475.000000  1117.250000   97.750000
50%    1600.000000  1329.000000   99.000000
75%    2000.000000  1418.250000  105.000000
max    2500.000000  1746.000000  120.000000

In [6]:
df.sample()

        Car Model  Volume  Weight  CO2
10  Hyundai   I20    1100     980   99

In [7]:
df.dtypes

Car       object
Model     object
Volume     int64
Weight     int64
CO2        int64
dtype: object

In [8]:
## Handling Missing Values
df.isnull().any()

Car       False
Model     False
Volume    False
Weight    False
CO2       False
dtype: bool

In [9]:
df.isnull().sum()

Car       0
Model     0
Volume    0
Weight    0
CO2       0
dtype: int64

### How to Fill NA

Since we don't have NA values, we can fill NA with:

df_filled = df.fillna(0)

df['Sales_fillNA'] = df['Sales'].fillna(df['Sales'].mean()) df

In [10]:
df.dtypes

Car       object
Model     object
Volume     int64
Weight     int64
CO2        int64
dtype: object

In [11]:
## Renaming Columns
df=df.rename(columns={'Car':'Auto Mobile'})
df.head()

  Auto Mobile       Model  Volume  Weight  CO2
0      Toyoty        Aygo    1000     790   99
1  Mitsubishi  Space Star    1200    1160   95
2       Skoda      Citigo    1000     929   95
3        Fiat         500     900     865   90
4        Mini      Cooper    1500    1140  105

In [12]:
## change datatypes
df['Volume']=df['Volume'].astype(float)
df.head()

  Auto Mobile       Model  Volume  Weight  CO2
0      Toyoty        Aygo  1000.0     790   99
1  Mitsubishi  Space Star  1200.0    1160   95
2       Skoda      Citigo  1000.0     929   95
3        Fiat         500   900.0     865   90
4        Mini      Cooper  1500.0    1140  105

In [13]:
df['Volume']=df['Volume'].apply(lambda x:x*2)
df.head()

  Auto Mobile       Model  Volume  Weight  CO2
0      Toyoty        Aygo  2000.0     790   99
1  Mitsubishi  Space Star  2400.0    1160   95
2       Skoda      Citigo  2000.0     929   95
3        Fiat         500  1800.0     865   90
4        Mini      Cooper  3000.0    1140  105

### Aggregate & Group By

In [14]:
## Data Aggregating And Grouping
df.head()

  Auto Mobile       Model  Volume  Weight  CO2
0      Toyoty        Aygo  2000.0     790   99
1  Mitsubishi  Space Star  2400.0    1160   95
2       Skoda      Citigo  2000.0     929   95
3        Fiat         500  1800.0     865   90
4        Mini      Cooper  3000.0    1140  105

In [ ]:
grouped_mean=df.groupby('Product')['Value'].mean()
print(grouped_mean)io

KeyError: 'Product'

In [25]:
grouped_sum=df.groupby(['Product','Region'])['Value'].sum()
print(grouped_sum)

Product   Region
Product1  East      292.0
          North       9.0
          South     100.0
          West      246.0
Product2  East       56.0
          North     127.0
          South     181.0
          West      428.0
Product3  East      202.0
          North     203.0
          South     215.0
          West      373.0
Name: Value, dtype: float64

In [26]:
df.groupby(['Product','Region'])['Value'].mean()

Product   Region
Product1  East      41.714286
          North      4.500000
          South     50.000000
          West      82.000000
Product2  East      28.000000
          North     63.500000
          South     60.333333
          West      53.500000
Product3  East      50.500000
          North     40.600000
          South     71.666667
          West      62.166667
Name: Value, dtype: float64

In [27]:
## aggregate multiple functions
groudped_agg=df.groupby('Region')['Value'].agg(['mean','sum','count'])
groudped_agg

             mean     sum  count
Region
East    42.307692   550.0     13
North   37.666667   339.0      9
South   62.000000   496.0      8
West    61.588235  1047.0     17

### Merge Data Frames

In [28]:
# Create sample DataFrames
df1 = pd.DataFrame({'Key': ['A', 'B', 'C'], 'Value1': [1, 2, 3]})
df2 = pd.DataFrame({'Key': ['A', 'B', 'D'], 'Value2': [4, 5, 6]})

In [29]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [30]:
df2

  Key  Value2
0   A       4
1   B       5
2   D       6

In [31]:
pd.merge(df1,df2,on="Key",how="inner")

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [32]:
pd.merge(df1,df2,on="Key",how="outer")

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [33]:
pd.merge(df1,df2,on="Key",how="left")

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [34]:
pd.merge(df1,df2,on="Key",how="right")

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6